import { Component } from '@angular/core';

@Component({
  selector: 'app-root',
  template: '<router-outlet></router-outlet>',
})
export class AppComponent {
  title = 'diplom_front';
  hot_meals: any = [
    {
      id: 1,
      image: 'https://kartinkin.net/uploads/posts/2021-03/1617207863_26-p-steik-tibon-krasivo-35.jpg',
      title: 'Стейк Тибон',
      amount: '7500',
      ingredients: 'Теңіз тұзы, ұнтақталған кориандр, зира (тұқым), кептірілген паприка, қыша (тұқым), қара бұрыш, кептірілген сарымсақ (түйіршіктер), кептірілген қызанақ (кесектер), қызыл бұрыш ыстық чили (кесектер).',
      about: 'Тибон стейкі немесе T-Bone Steak өз атауын Т-тәрізді сүйектен алады. Бір жағынан, оған филе Миньоны бекітілген, ол нәзік сиыр еті, ал екінші жағынан, стейк Стейктеріне сәйкес келетін қатты хош иісті ет бар.',
      time: '35',
      disabled: false,
      count: 0
    },
    {
      id: 2,
      image: 'https://www.burgermeister.ru/images/docs/Image/rib-eye_steak-xxl.jpg',
      title: 'Стейк Рибай',
      amount: '9500',
      ingredients: 'сиыр еті, картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Сиыр Стейкінің қабырғасы неден жасалады? Жауап атауынан айқын көрінеді: сиыр етінен, әрине, мәрмәр. Бұл арнайы технологиялармен өсірілетін арнайы ет тұқымдарының Гоби еті. Олар генетикалық тұрғыдан сиыр етінде мәрмәр тамырларының пайда болуына бейім.',
      time: '30',
      disabled: false,
      count: 0
    },
    {
      id: 3,
      image: 'https://kultura64.ru/wp-content/uploads/2017/12/Hinkali-3.jpg',
      title: 'Хинкали',
      amount: '3900',
      ingredients: 'сиыр еті, картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Нағыз грузин хинкали-сіз әлі мұндай дәмді жеген жоқсыз! Үйде ең дәмді хинкалиді дайындауға арналған Рецепт - қалай дұрыс мүсіндеу керек, қалай пісіру керек, қандай хинкали қамыры қажет. Үйдегі хинкали-шырынды және хош иісті!',
      time: '28',
      disabled: false,
      count: 0
    },
    {
      id: 4,
      image: 'https://mykaleidoscope.ru/x/uploads/posts/2022-09/1663873215_32-mykaleidoscope-ru-p-zharenii-gus-yeda-krasivo-36.jpg',
      title: 'Үйрек еті',
      amount: '6200',
      ingredients: 'Үйрек еті, картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Нағыз грузин хинкали-сіз әлі мұндай дәмді жеген жоқсыз! Үйде ең дәмді хинкалиді дайындауға арналған Рецепт - қалай дұрыс мүсіндеу керек, қалай пісіру керек, қандай хинкали қамыры қажет. Үйдегі хинкали-шырынды және хош иісті!',
      time: '24',
      disabled: false,
      count: 0
    },
    {
      id: 5,
      image: 'https://granat36.ru/wp-content/uploads/2022/03/137560-2.jpg',
      title: 'Котлет',
      amount: '4800',
      ingredients: 'сиыр еті, картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Нағыз грузин хинкали-сіз әлі мұндай дәмді жеген жоқсыз! Үйде ең дәмді хинкалиді дайындауға арналған Рецепт - қалай дұрыс мүсіндеу керек, қалай пісіру керек, қандай хинкали қамыры қажет. Үйдегі хинкали-шырынды және хош иісті!',
      time: '18',
      disabled: false,
      count: 0
    },
    {
      id: 6,
      image: 'https://i.pinimg.com/originals/c5/d4/a7/c5d4a7a0398efee1398d6d88cf69becf.jpg',
      title: 'Тауық котлеті',
      amount: '8500',
      ingredients: 'Тауық еті, картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Нағыз грузин хинкали-сіз әлі мұндай дәмді жеген жоқсыз! Үйде ең дәмді хинкалиді дайындауға арналған Рецепт - қалай дұрыс мүсіндеу керек, қалай пісіру керек, қандай хинкали қамыры қажет. Үйдегі хинкали-шырынды және хош иісті!',
      time: '28',
      disabled: false,
      count: 0
    },
    {
      id: 7,
      image: 'https://photorecept.ru/wp-content/uploads/2021/11/9-1024x652.jpg',
      title: 'Манты',
      amount: '6100',
      ingredients: 'сиыр еті, картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Нағыз грузин хинкали-сіз әлі мұндай дәмді жеген жоқсыз! Үйде ең дәмді хинкалиді дайындауға арналған Рецепт - қалай дұрыс мүсіндеу керек, қалай пісіру керек, қандай хинкали қамыры қажет. Үйдегі хинкали-шырынды және хош иісті!',
      time: '17',
      disabled: false,
      count: 0
    },
    {
      id: 8,
      image: 'https://kartinkin.net/uploads/posts/2021-04/1617229965_10-p-zharkoe-iz-govyadini-s-kartoshkoi-v-kazane-11.jpg',
      title: 'Қуырдақ',
      amount: '7700',
      ingredients: 'сиыр еті, картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Нағыз грузин хинкали-сіз әлі мұндай дәмді жеген жоқсыз! Үйде ең дәмді хинкалиді дайындауға арналған Рецепт - қалай дұрыс мүсіндеу керек, қалай пісіру керек, қандай хинкали қамыры қажет. Үйдегі хинкали-шырынды және хош иісті!',
      time: '27',
      disabled: false,
      count: 0
    },
    {
      id: 9,
      image: 'https://porodysobak.ru/wp-content/uploads/2022/01/kartofel.jpg',
      title: 'Картофел',
      amount: '5600',
      ingredients: 'картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Нағыз грузин хинкали-сіз әлі мұндай дәмді жеген жоқсыз! Үйде ең дәмді хинкалиді дайындауға арналған Рецепт - қалай дұрыс мүсіндеу керек, қалай пісіру керек, қандай хинкали қамыры қажет. Үйдегі хинкали-шырынды және хош иісті!',
      time: '22',
      disabled: false,
      count: 0
    },
    {
      id: 10,
      image: 'https://нижегородптица.рф/files/catalog/product/2018/04/197.jpg',
      title: 'Тауық еті',
      amount: '3700',
      ingredients: 'Тауық еті, картоп, қызанақ, болгар бұрышы, пияз, сәбіз, сарымсақ, томат пастасы, ұн, өсімдік майы, тұз, бұрыш.',
      about: 'Нағыз грузин хинкали-сіз әлі мұндай дәмді жеген жоқсыз! Үйде ең дәмді хинкалиді дайындауға арналған Рецепт - қалай дұрыс мүсіндеу керек, қалай пісіру керек, қандай хинкали қамыры қажет. Үйдегі хинкали-шырынды және хош иісті!',
      time: '18',
      disabled: false,
      count: 0
    }
  ];
  diet_meals: any = [
    {
      id: 11,
      image: 'https://i.ytimg.com/vi/S_QBwbvlUQs/maxresdefault.jpg',
      title: 'Салат Малибу',
      amount: '5500',
      ingredients: 'Ысталған тауық (барабан таяқшасы) - 150 г жаңа қияр - 150 г үлкен қызанақ-1 дана. қатты ірімшік-50 г крекер-40 г Майонез-2 ас қасық. қасық тұз (міндетті емес) - дәміне қарай',
      about: 'Осындай экзотикалық атауға қарамастан, "Малибу" салатында шетелде қандай да бір көркем өнімдер жоқ. Ысталған тауық еті, жаңа піскен көкөністер, ірімшік және крекер-бұл салаттың негізгі ингредиенттері. Бұл рецепт бойынша Салат өте дәмді және бәріне ұнайды.',
      time: '17',
      count: 1,
      disabled: false
    },
    {
      id: 12,
      image: 'https://podacha-blud.com/uploads/posts/2022-12/1670425883_1-podacha-blud-com-p-salat-vinegret-foto-1.jpg',
      title: 'Салат Винегрет',
      amount: '8900',
      ingredients: 'қызылша, сәбіз, картоп, бұршақ жасыл балмұздақ, пияз, лимон шырыны, тұз, Өсімдік майы.',
      about: 'Винегрет-бұл қайнатылған көкөністерден жасалған салат, ол өз атауын ХХ ғасырдың басына дейін кең таралған осы тағамға арналған салат таңғышына қарыздар.',
      time: '12',
      count: 1,
      disabled: false
    },
    {
      id: 13,
      image: 'https://i.pinimg.com/originals/65/9c/a1/659ca1fe6659947e2b5d2cbc70ec6bb5.jpg',
      title: 'Холодец',
      amount: '3200',
      ingredients: 'Ысталған тауық (барабан таяқшасы) - 50 г жаңа қияр - 70 г үлкен қызанақ-1 дана. қатты ірімшік-50 г крекер-40 г Майонез-2 ас қасық. қасық тұз (міндетті емес) - дәміне қарай',
      about: 'Осындай экзотикалық атауға қарамастан, "Малибу" салатында шетелде қандай да бір көркем өнімдер жоқ. Ысталған тауық еті, жаңа піскен көкөністер, ірімшік және крекер-бұл салаттың негізгі ингредиенттері. Бұл рецепт бойынша Салат өте дәмді және бәріне ұнайды.',
      time: '19',
      count: 1,
      disabled: false
    },
    {
      id: 14,
      image: 'https://mykaleidoscope.ru/x/uploads/posts/2022-10/1666312084_24-mykaleidoscope-ru-p-salat-tsezar-s-tuntsom-vkontakte-31.jpg',
      title: 'Салат Цезарь',
      amount: '6200',
      ingredients: 'Ысталған тауық (барабан таяқшасы) - 150 г жаңа қияр - 150 г үлкен қызанақ-1 дана. қатты ірімшік-50 г крекер-40 г Майонез-2 ас қасық. қасық тұз (міндетті емес) - дәміне қарай',
      about: 'Осындай экзотикалық атауға қарамастан, "Малибу" салатында шетелде қандай да бір көркем өнімдер жоқ. Ысталған тауық еті, жаңа піскен көкөністер, ірімшік және крекер-бұл салаттың негізгі ингредиенттері. Бұл рецепт бойынша Салат өте дәмді және бәріне ұнайды.',
      time: '11',
      count: 1,
      disabled: false
    },
    {
      id: 15,
      image: 'https://podacha-blud.com/uploads/posts/2022-12/1670448276_5-podacha-blud-com-p-salat-s-semgoi-foto-5.jpg',
      title: 'Салат семги',
      amount: '4800',
      ingredients: 'Ысталған тауық (барабан таяқшасы) - 150 г жаңа қияр - 150 г үлкен қызанақ-1 дана. қатты ірімшік-50 г крекер-40 г Майонез-2 ас қасық. қасық тұз (міндетті емес) - дәміне қарай',
      about: 'Осындай экзотикалық атауға қарамастан, "Малибу" салатында шетелде қандай да бір көркем өнімдер жоқ. Ысталған тауық еті, жаңа піскен көкөністер, ірімшік және крекер-бұл салаттың негізгі ингредиенттері. Бұл рецепт бойынша Салат өте дәмді және бәріне ұнайды.',
      time: '22',
      count: 1,
      disabled: false
    }
  ];
  dessert_meals: any = [
    {
      id: 16,
      image: 'https://static.1000.menu/img/content-v2/65/97/40300/tvorog-s-bananom_1572608832_prev_hor.jpg',
      title: 'Сметана қосылған банан',
      amount: '9900',
      ingredients: 'Сметана, Бананы, зира (тұқым), Мёд, қыша (тұқым), Ванилин, Сметана, Грецкие орехи, Печенье песочное.',
      about: 'Нәзік, сау, өте дәмді. Бүкіл отбасы үшін. Банан қосылған сүзбе-бұл тіпті сүзбені ұнатпайтындарға ұнайтын десерт. Майы аз тағамдарды қолдана отырып, сіз диеталық ем ала аласыз. Десерттің дәмін әртүрлі қоспалар - жаңғақтар, печенье, жидектер арқылы әртараптандыруға болады.',
      time: '45',
      count: 1,
      disabled: false
    },
    {
      id: 17,
      image: 'https://static.1000.menu/img/content-v2/04/9b/4024/klubnika-so-slivkami-desert_1612873445_prev_hor.jpg',
      title: 'Клубника қаймақпен',
      amount: '9700',
      ingredients: 'Сметана, Клубника, зира (тұқым), Мёд, қыша (тұқым), Ванилин, Сметана, Грецкие орехи, Печенье песочное.',
      about: 'Теңдесі жоқ дәмді және қарапайым! Тіпті баланы пісіріңіз. Мен кілегей мен жаңа, хош иісті құлпынайдан гөрі тағамдардың комбинациясын білмеймін. Десерт өте тез дайындалады және өте дәмді болып шығады. Кілегей қосылған құлпынай мерекелік үстелге де жарайды. Бұл комбинацияны балалар да, ересектер де жақсы көреді.',
      time: '30',
      count: 1,
      disabled: false
    },
    {
      id: 18,
      image: 'https://static.1000.menu/img/content-v2/88/e8/43878/shokoladnyi-muss-na-desert_1614767011_prev_hor.jpg',
      title: 'Шоколадты десерт',
      amount: '9500',
      ingredients: 'Шоколадты, Бананы, зира (тұқым), Мёд, қыша (тұқым), Ванилин, Сметана, Грецкие орехи, Печенье песочное.',
      about: 'Дәмді және қарапайым! Тіпті баланы пісіріңіз. Мен кілегей мен жаңа, хош иісті құлпынайдан гөрі тағамдардың комбинациясын білмеймін. Десерт өте тез дайындалады және өте дәмді болып шығады. Кілегей қосылған құлпынай мерекелік үстелге де жарайды. Бұл комбинацияны балалар да, ересектер де жақсы көреді.',
      time: '25',
      count: 1,
      disabled: false
    },
    {
      id: 19,
      image: 'https://static.1000.menu/img/content-v2/14/54/41685/krem-desert_1576683878_prev_hor.jpg',
      title: 'Крем десерт',
      amount: '7350',
      ingredients: 'Сметана, Крем, зира (тұқым), Мёд, қыша (тұқым), Ванилин, Сметана, Грецкие орехи, Печенье песочное.',
      about: 'Дәмді және қарапайым! Тіпті баланы пісіріңіз. Мен кілегей мен жаңа, хош иісті құлпынайдан гөрі тағамдардың комбинациясын білмеймін. Десерт өте тез дайындалады және өте дәмді болып шығады. Кілегей қосылған құлпынай мерекелік үстелге де жарайды. Бұл комбинацияны балалар да, ересектер де жақсы көреді.',
      time: '20',
      count: 1,
      disabled: false
    },
    {
      id: 20,
      image: 'https://static.1000.menu/img/content-v2/a9/97/40253/yabloki-v-karameli-v-domashnix-usloviyax_1615965583_prev_hor.jpg',
      title: 'Қаймақтағы алма',
      amount: '8940',
      ingredients: 'Қаймақ, алма, зира (тұқым), Мёд, қыша (тұқым), Ванилин, Сметана, Грецкие орехи, Печенье песочное.',
      about: 'Дәмді және қарапайым! Тіпті баланы пісіріңіз. Мен кілегей мен жаңа, хош иісті құлпынайдан гөрі тағамдардың комбинациясын білмеймін. Десерт өте тез дайындалады және өте дәмді болып шығады. Кілегей қосылған құлпынай мерекелік үстелге де жарайды. Бұл комбинацияны балалар да, ересектер де жақсы көреді.!',
      time: '32',
      count: 1,
      disabled: false
    },
    {
      id: 21,
      image: 'https://static.1000.menu/img/content-v2/fd/1e/26104/jele-iz-agar-agara_1626637129_prev_hor.jpg',
      title: 'Агар дағы желе десерті',
      amount: '6710',
      ingredients: 'Желе, Бананы, зира (тұқым), Мёд, қыша (тұқым), Ванилин, Сметана, Грецкие орехи, Печенье песочное.',
      about: 'Дәмді және қарапайым! Тіпті баланы пісіріңіз. Мен кілегей мен жаңа, хош иісті құлпынайдан гөрі тағамдардың комбинациясын білмеймін. Десерт өте тез дайындалады және өте дәмді болып шығады. Кілегей қосылған құлпынай мерекелік үстелге де жарайды. Бұл комбинацияны балалар да, ересектер де жақсы көреді.',
      time: '18',
      count: 1,
      disabled: false
    },
    {
      id: 22,
      image: 'https://static.1000.menu/img/content-v2/17/14/11691/italyanskaya-merenga_1618550601_prev_hor.jpg',
      title: 'Италиялық маренга',
      amount: '8830',
      ingredients: 'Маренга, зира (тұқым), Мёд, қыша (тұқым), Ванилин, Сметана, Грецкие орехи, Печенье песочное.',
      about: 'Дәмді және қарапайым! Тіпті баланы пісіріңіз. Мен кілегей мен жаңа, хош иісті құлпынайдан гөрі тағамдардың комбинациясын білмеймін. Десерт өте тез дайындалады және өте дәмді болып шығады. Кілегей қосылған құлпынай мерекелік үстелге де жарайды. Бұл комбинацияны балалар да, ересектер де жақсы көреді.',
      time: '27',
      count: 1,
      disabled: false
    },
    {
      id: 23,
      image: 'https://static.1000.menu/img/content-v2/cb/b0/72370/limon-s-yaicom-desert_1676976209_prev_hor.jpg',
      title: 'Лимон қосылған жұмыртқа',
      amount: '3220',
      ingredients: 'Сметана, Лимон, зира (тұқым), Мёд, қыша (тұқым), Ванилин, Сметана, Грецкие орехи, Печенье песочное.',
      about: 'Дәмді және қарапайым! Тіпті баланы пісіріңіз. Мен кілегей мен жаңа, хош иісті құлпынайдан гөрі тағамдардың комбинациясын білмеймін. Десерт өте тез дайындалады және өте дәмді болып шығады. Кілегей қосылған құлпынай мерекелік үстелге де жарайды. Бұл комбинацияны балалар да, ересектер де жақсы көреді.',
      time: '50',
      count: 1,
      disabled: false
    }
  ];

  ngOnInit() {
    this.generate_admin();
    this.generate_all_meals();
    this.generate_roles();
    this.generate_meals();
    this.generate_titles();
    this.generate_current_meals();
  }

  generate_meals() {
    let meals = localStorage.getItem('meals');
    if (meals) return
    else localStorage.setItem('meals', JSON.stringify([]));
  }

  generate_titles() {
    let meals_title = localStorage.getItem('titles');
    if (meals_title) return
    else {
      let hot_meals = {
        id: 1,
        label: 'Ыстық тағам'
      };
      let diet_meals = {
        id: 2,
        label: 'Диеталық тағам'
      };
      let desserts = {
        id: 3,
        label: 'Десерттер'
      };
      localStorage.setItem('titles', JSON.stringify([hot_meals, diet_meals, desserts]));
    }
  }

  generate_all_meals() {
    let all_meals = localStorage.getItem('all_meals');
    if (all_meals) return
    else {
      let hot_meals = {
        label: 'Ыстық тағам',
        meals: this.hot_meals
      };
      let diet_meals = {
        label: 'Диеталық тағам',
        meals: this.diet_meals
      };
      let dessert_meals = {
        label: 'Десерттер',
        meals: this.dessert_meals
      }
      let all_meals_clone = [hot_meals, diet_meals, dessert_meals]
      localStorage.setItem('all_meals', JSON.stringify(all_meals_clone));
    }
  }

  generate_roles() {
    let roles = localStorage.getItem('roles');
    if (roles) return
    else {
      let def_rols = {
        title: 'Admin01@gmail.com',
        password: '12345'
      };
      localStorage.setItem('roles', JSON.stringify([def_rols]));
    }
  }

  generate_admin() {
    let admin = localStorage.getItem('admin');
    if (admin) return
    else {
      let admin = {
        title: 'Admin@gmail.com',
        password: '1234'
      };
      localStorage.setItem('admin', JSON.stringify(admin));
    }
  }

  generate_current_meals() {
    let current_meals = localStorage.getItem('current_meals');
    if (current_meals) return
    else localStorage.setItem('current_meals', JSON.stringify([]));
  }
}
